amd-cloud/logs/atom/kimi_single_stream_20260820_174733/K1_mad_default/c4.log
[aiter] import [module_aiter_core] under /app/aiter-test/aiter/jit/module_aiter_core.so
[atom 18:05:24] Raised RLIMIT_NOFILE soft limit 1024 -> 65535 (hard=524288)
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]
Namespace(backend='vllm', base_url='http://localhost:8022', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=4, model='/model', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/out', result_filename='c4.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=1)
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=828   max=1014  mean=918.15   avg_token_mismatch=0.00  
 output_lens: min=828   max=1016  mean=935.25  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 1 requests...
100%|██████████| 1/1 [00:22<00:00, 22.23s/it]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
100%|██████████| 20/20 [02:09<00:00,  6.49s/it]
Starting main benchmark run...
============ Serving Benchmark Result ============
Successful requests:                     20        
Benchmark duration (s):                  129.72    
Total input tokens:                      18363     
Total generated tokens:                  18705     
Request throughput (req/s):              0.15      
Output token throughput (tok/s):         144.20    
Total Token throughput (tok/s):          285.76    
Concurrency:                             3.87      
---------------Time to First Token----------------
Mean TTFT (ms):                          338.76    
Median TTFT (ms):                        250.21    
P99 TTFT (ms):                           696.22    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          26.51     
Median TPOT (ms):                        26.53     
P99 TPOT (ms):                           26.87     
---------------Inter-token Latency----------------
Mean ITL (ms):                           26.48     
Median ITL (ms):                         26.00     
P99 ITL (ms):                            29.37     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          25107.66  
Median E2EL (ms):                        25206.58  
P99 E2EL (ms):                           27408.63  
==================================================